Revit 2027 API
MultiReferenceAnnotation.AreReferencesValidForLinearFixedDimension Method
 If the DimensionStyleType is LinearFixed, validates that the references are valid for an aligned multi-reference annotation.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static bool AreReferencesValidForLinearFixedDimension(
	Document document,
	ElementId ownerViewId,
	MultiReferenceAnnotationOptions options
)
Public Shared Function AreReferencesValidForLinearFixedDimension (
	document As Document,
	ownerViewId As ElementId,
	options As MultiReferenceAnnotationOptions
) As Boolean
public:
static bool AreReferencesValidForLinearFixedDimension(
	Document^ document,
	ElementId^ ownerViewId,
	MultiReferenceAnnotationOptions^ options
)
static member AreReferencesValidForLinearFixedDimension :
        document : Document *
        ownerViewId : ElementId *
        options : MultiReferenceAnnotationOptions -> bool
Parameters
document Document
 The document for the multi-reference annotation.
ownerViewId ElementId
 The view in which the multi-reference annotation will appear.
options MultiReferenceAnnotationOptions
 Options containing the references which the dimension will witness.
Return Value
Boolean
 True DimensionStyleType does not equal LinearFixed or if an aligned multi-reference annotation can be created from the references.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
See Also
Reference
MultiReferenceAnnotation Class
Autodesk.Revit.DB Namespace